AndEmi81/indesit_inertia_rx210/HAL/RN_RX100/RN_RX100_reg.h
/***********************************************************************/
/*  													               */
/*      PROJECT NAME :  Prova_RX100                                    */
/*      FILE         :  iodefine.h                                     */
/*      DESCRIPTION  :  Definition of I/O Registers                    */
/*      CPU SERIES   :  RX100                                          */
/*      CPU TYPE     :  RX110                                          */
/*  													               */
/*      This file is generated by e2 studio.                        */
/*  													               */
/***********************************************************************/ 
                                                                           

/************************************************************************/
/*    File Version: V1.00                                               */
/*    Date Generated(DD/MM/YYYY): 09/08/2013                            */
/* History    : V0.5  (2012-09-25)  [Hardware Manual Revision : 0.50]           */  
/*            : V1.0A  (2013-08-22)  [Hardware Manual Revision : 1.00]          */
/************************************************************************/

/* Generated by GNURX IO Header File Converter */

#ifndef __RX110IODEFINE_HEADER__
#define __RX110IODEFINE_HEADER__
#ifdef __RX_LITTLE_ENDIAN__
struct st_bsc {
    union {
        unsigned char BYTE;
        struct {
            unsigned char STSCLR:1;
            unsigned char :7;
        } BIT;
    } BERCLR;
    char           wk0[3];
    union {
        unsigned char BYTE;
        struct {
            unsigned char IGAEN:1;
            unsigned char :7;
        } BIT;
    } BEREN;
    char           wk1[3];
    union {
        unsigned char BYTE;
        struct {
            unsigned char IA:1;
            unsigned char :3;
            unsigned char MST:3;
            unsigned char :1;
        } BIT;
    } BERSR1;
    char           wk2[1];
    union {
        unsigned short WORD;
        struct {
            unsigned short :3;
            unsigned short ADDR:13;
        } BIT;
    } BERSR2;
    char           wk3[4];
    union {
        unsigned short WORD;
        struct {
            unsigned short BPRA:2;
            unsigned short BPRO:2;
            unsigned short BPIB:2;
            unsigned short BPGB:2;
            unsigned short :2;
            unsigned short BPFB:2;
            unsigned short :4;
        } BIT;
    } BUSPRI;
};

struct st_cac {
    union {
        unsigned char BYTE;
        struct {
            unsigned char CFME:1;
            unsigned char :7;
        } BIT;
    } CACR0;
    union {
        unsigned char BYTE;
        struct {
            unsigned char CACREFE:1;
            unsigned char FMCS:3;
            unsigned char TCSS:2;
            unsigned char EDGES:2;
        } BIT;
    } CACR1;
    union {
        unsigned char BYTE;
        struct {
            unsigned char RPS:1;
            unsigned char RSCS:3;
            unsigned char RCDS:2;
            unsigned char DFS:2;
        } BIT;
    } CACR2;
    union {
        unsigned char BYTE;
        struct {
            unsigned char FERRIE:1;
            unsigned char MENDIE:1;
            unsigned char OVFIE:1;
            unsigned char :1;
            unsigned char FERRFCL:1;
            unsigned char MENDFCL:1;
            unsigned char OVFFCL:1;
            unsigned char :1;
        } BIT;
    } CAICR;
    union {
        unsigned char BYTE;
        struct {
            unsigned char FERRF:1;
            unsigned char MENDF:1;
            unsigned char OVFF:1;
            unsigned char :5;
        } BIT;
    } CASTR;
    char           wk0[1];
    unsigned short CAULVR;
    unsigned short CALLVR;
    unsigned short CACNTBR;
};

struct st_cmt {
    union {
        unsigned short WORD;
        struct {
            unsigned short STR0:1;
            unsigned short STR1:1;
            unsigned short :14;
        } BIT;
    } CMSTR0;
};

struct st_cmt0 {
    union {
        unsigned short WORD;
        struct {
            unsigned short CKS:2;
            unsigned short :4;
            unsigned short CMIE:1;
            unsigned short :9;
        } BIT;
    } CMCR;
    unsigned short CMCNT;
    unsigned short CMCOR;
};

struct st_crc {
    union {
        unsigned char BYTE;
        struct {
            unsigned char GPS:2;
            unsigned char LMS:1;
            unsigned char :4;
            unsigned char DORCLR:1;
        } BIT;
    } CRCCR;
    unsigned char  CRCDIR;
    unsigned short CRCDOR;
};

struct st_doc {
    union {
        unsigned char BYTE;
        struct {
            unsigned char OMS:2;
            unsigned char DCSEL:1;
            unsigned char :1;
            unsigned char DOPCIE:1;
            unsigned char DOPCF:1;
            unsigned char DOPCFCL:1;
            unsigned char :1;
        } BIT;
    } DOCR;
    char           wk0[1];
    unsigned short DODIR;
    unsigned short DODSR;
};

struct st_dtc {
    union {
        unsigned char BYTE;
        struct {
            unsigned char :4;
            unsigned char RRS:1;
            unsigned char :3;
        } BIT;
    } DTCCR;
    char           wk0[3];
    void          *DTCVBR;
    union {
        unsigned char BYTE;
        struct {
            unsigned char SHORT:1;
            unsigned char :7;
        } BIT;
    } DTCADMOD;
    char           wk1[3];
    union {
        unsigned char BYTE;
        struct {
            unsigned char DTCST:1;
            unsigned char :7;
        } BIT;
    } DTCST;
    char           wk2[1];
    union {
        unsigned short WORD;
        struct {
            unsigned short VECN:8;
            unsigned short :7;
            unsigned short ACT:1;
        } BIT;
    } DTCSTS;
};
struct st_flash {
    union {
        unsigned char BYTE;
        struct {
            unsigned char DFLEN:1;
            unsigned char :7;
        } BIT;
    } DFLCTL;
};
struct st_icu {
    union {
        unsigned char BYTE;
        struct {
            unsigned char IR:1;
            unsigned char :7;
        } BIT;
    } IR[250];
    char           wk0[6];
    union {
        unsigned char BYTE;
        struct {
            unsigned char DTCE:1;
            unsigned char :7;
        } BIT;
    } DTCER[249];
    char           wk1[7];
    union {
        unsigned char BYTE;
        struct {
            unsigned char IEN0:1;
            unsigned char IEN1:1;
            unsigned char IEN2:1;
            unsigned char IEN3:1;
            unsigned char IEN4:1;
            unsigned char IEN5:1;
            unsigned char IEN6:1;
            unsigned char IEN7:1;
        } BIT;
    } IER[32];
    char           wk2[192];
    union {
        unsigned char BYTE;
        struct {
            unsigned char SWINT:1;
            unsigned char :7;
        } BIT;
    } SWINTR;
    char           wk3[15];
    union {
        unsigned short WORD;
        struct {
            unsigned short FVCT:8;
            unsigned short :7;
            unsigned short FIEN:1;
        } BIT;
    } FIR;
    char           wk4[14];
    union {
        unsigned char BYTE;
        struct {
            unsigned char IPR:4;
            unsigned char :4;
        } BIT;
    } IPR[250];
    char           wk5[262];
    union {
        unsigned char BYTE;
        struct {
            unsigned char :2;
            unsigned char IRQMD:2;
            unsigned char :4;
        } BIT;
    } IRQCR[8];
    char           wk6[8];
    union {
        unsigned char BYTE;
        struct {
            unsigned char FLTEN0:1;
            unsigned char FLTEN1:1;
            unsigned char FLTEN2:1;
            unsigned char FLTEN3:1;
            unsigned char FLTEN4:1;
            unsigned char FLTEN5:1;
            unsigned char FLTEN6:1;
            unsigned char FLTEN7:1;
        } BIT;
    } IRQFLTE0;
    char           wk7[3];
    union {
        unsigned short WORD;
        struct {
            unsigned short FCLKSEL0:2;
            unsigned short FCLKSEL1:2;
            unsigned short FCLKSEL2:2;
            unsigned short FCLKSEL3:2;
            unsigned short FCLKSEL4:2;
            unsigned short FCLKSEL5:2;
            unsigned short FCLKSEL6:2;
            unsigned short FCLKSEL7:2;
        } BIT;
    } IRQFLTC0;
    char           wk8[106];
    union {
        unsigned char BYTE;
        struct {
            unsigned char NMIST:1;
            unsigned char OSTST:1;
            unsigned char :1;
            unsigned char IWDTST:1;
            unsigned char LVD1ST:1;
            unsigned char LVD2ST:1;
            unsigned char :2;
        } BIT;
    } NMISR;
    union {
        unsigned char BYTE;
        struct {
            unsigned char NMIEN:1;
            unsigned char OSTEN:1;
            unsigned char :1;
            unsigned char IWDTEN:1;
            unsigned char LVD1EN:1;
            unsigned char LVD2EN:1;
            unsigned char :2;
        } BIT;
    } NMIER;
    union {
        unsigned char BYTE;
        struct {
            unsigned char NMICLR:1;
            unsigned char OSTCLR:1;
            unsigned char :1;
            unsigned char IWDTCLR:1;
            unsigned char LVD1CLR:1;
            unsigned char LVD2CLR:1;
            unsigned char :2;
        } BIT;
    } NMICLR;
    union {
        unsigned char BYTE;
        struct {
            unsigned char :3;
            unsigned char NMIMD:1;
            unsigned char :4;
        } BIT;
    } NMICR;
    char           wk9[12];
    union {
        unsigned char BYTE;
        struct {
            unsigned char NFLTEN:1;
            unsigned char :7;
        } BIT;
    } NMIFLTE;
    char           wk10[3];
    union {
        unsigned char BYTE;
        struct {
            unsigned char NFCLKSEL:2;
            unsigned char :6;
        } BIT;
    } NMIFLTC;
};

