AndEmi81/indesit_inertia_rx210/HAL/RN_RX100/RN_RX100_reg.h
struct st_s12ad {
    union {
        unsigned short WORD;
        struct {
            unsigned short DBLANS:5;
            unsigned short :1;
            unsigned short GBADIE:1;
            unsigned short DBLE:1;
            unsigned short EXTRG:1;
            unsigned short TRGE:1;
            unsigned short ADHSC:1;
            unsigned short :1;
            unsigned short ADIE:1;
            unsigned short ADCS:2;
            unsigned short ADST:1;
        } BIT;
    } ADCSR;
    char           wk0[2];
    union {
        unsigned short WORD;
        struct {
            unsigned short ANSA0:1;
            unsigned short ANSA1:1;
            unsigned short ANSA2:1;
            unsigned short ANSA3:1;
            unsigned short ANSA4:1;
            unsigned short :1;
            unsigned short ANSA6:1;
            unsigned short :1;
            unsigned short ANSA8:1;
            unsigned short ANSA9:1;
            unsigned short ANSA10:1;
            unsigned short ANSA11:1;
            unsigned short ANSA12:1;
            unsigned short ANSA13:1;
            unsigned short ANSA14:1;
            unsigned short ANSA15:1;
        } BIT;
    } ADANSA;
    char           wk1[2];
    union {
        unsigned short WORD;
        struct {
            unsigned short ADS0:1;
            unsigned short ADS1:1;
            unsigned short ADS2:1;
            unsigned short ADS3:1;
            unsigned short ADS4:1;
            unsigned short :1;
            unsigned short ADS6:1;
            unsigned short :1;
            unsigned short ADS8:1;
            unsigned short ADS9:1;
            unsigned short ADS10:1;
            unsigned short ADS11:1;
            unsigned short ADS12:1;
            unsigned short ADS13:1;
            unsigned short ADS14:1;
            unsigned short ADS15:1;
        } BIT;
    } ADADS;
    char           wk2[2];
    union {
        unsigned char BYTE;
        struct {
            unsigned char ADC:2;
            unsigned char :6;
        } BIT;
    } ADADC;
    char           wk3[1];
    union {
        unsigned short WORD;
        struct {
            unsigned short :5;
            unsigned short ACE:1;
            unsigned short :9;
            unsigned short ADRFMT:1;
        } BIT;
    } ADCER;
    union {
        unsigned short WORD;
        struct {
            unsigned short TRSB:4;
            unsigned short :4;
            unsigned short TRSA:4;
            unsigned short :4;
        } BIT;
    } ADSTRGR;
    union {
        unsigned short WORD;
        struct {
            unsigned short TSSAD:1;
            unsigned short OCSAD:1;
            unsigned short :6;
            unsigned short TSS:1;
            unsigned short OCS:1;
            unsigned short :6;
        } BIT;
    } ADEXICR;
    union {
        unsigned short WORD;
        struct {
            unsigned short ANSB0:1;
            unsigned short ANSB1:1;
            unsigned short ANSB2:1;
            unsigned short ANSB3:1;
            unsigned short ANSB4:1;
            unsigned short :1;
            unsigned short ANSB6:1;
            unsigned short :1;
            unsigned short ANSB8:1;
            unsigned short ANSB9:1;
            unsigned short ANSB10:1;
            unsigned short ANSB11:1;
            unsigned short ANSB12:1;
            unsigned short ANSB13:1;
            unsigned short ANSB14:1;
            unsigned short ANSB15:1;
        } BIT;
    } ADANSB;
    char           wk4[2];
    unsigned short ADDBLDR;
    unsigned short ADTSDR;
    unsigned short ADOCDR;
    char           wk5[2];
    unsigned short ADDR0;
    unsigned short ADDR1;
    unsigned short ADDR2;
    unsigned short ADDR3;
    unsigned short ADDR4;
    char           wk6[2];
    unsigned short ADDR6;
    char           wk7[2];
    unsigned short ADDR8;
    unsigned short ADDR9;
    unsigned short ADDR10;
    unsigned short ADDR11;
    unsigned short ADDR12;
    unsigned short ADDR13;
    unsigned short ADDR14;
    unsigned short ADDR15;
    char           wk8[32];
    unsigned char  ADSSTR0;
    unsigned char  ADSSTRL;
    char           wk9[14];
    unsigned char  ADSSTRT;
    unsigned char  ADSSTRO;
    char           wk10[1];
    unsigned char  ADSSTR1;
    unsigned char  ADSSTR2;
    unsigned char  ADSSTR3;
    unsigned char  ADSSTR4;
    char           wk11[1];
    unsigned char  ADSSTR6;
};

struct st_sci1 {
    union {
        unsigned char BYTE;
        struct {
            unsigned char CKS:2;
            unsigned char MP:1;
            unsigned char STOP:1;
            unsigned char PM:1;
            unsigned char PE:1;
            unsigned char CHR:1;
            unsigned char CM:1;
        } BIT;
    } SMR;
    unsigned char  BRR;
    union {
        unsigned char BYTE;
        struct {
            unsigned char CKE:2;
            unsigned char TEIE:1;
            unsigned char MPIE:1;
            unsigned char RE:1;
            unsigned char TE:1;
            unsigned char RIE:1;
            unsigned char TIE:1;
        } BIT;
    } SCR;
    unsigned char  TDR;
    union {
        unsigned char BYTE;
        struct {
            unsigned char MPBT:1;
            unsigned char MPB:1;
            unsigned char TEND:1;
            unsigned char PER:1;
            unsigned char FER:1;
            unsigned char ORER:1;
            unsigned char :2;
        } BIT;
    } SSR;
    unsigned char  RDR;
    union {
        unsigned char BYTE;
        struct {
            unsigned char SMIF:1;
            unsigned char :1;
            unsigned char SINV:1;
            unsigned char SDIR:1;
            unsigned char :3;
            unsigned char BCP2:1;
        } BIT;
    } SCMR;
    union {
        unsigned char BYTE;
        struct {
            unsigned char ACS0:1;
            unsigned char :3;
            unsigned char ABCS:1;
            unsigned char NFEN:1;
            unsigned char :1;
            unsigned char RXDESEL:1;
        } BIT;
    } SEMR;
    union {
        unsigned char BYTE;
        struct {
            unsigned char NFCS:3;
            unsigned char :5;
        } BIT;
    } SNFR;
    union {
        unsigned char BYTE;
        struct {
            unsigned char IICM:1;
            unsigned char :2;
            unsigned char IICDL:5;
        } BIT;
    } SIMR1;
    union {
        unsigned char BYTE;
        struct {
            unsigned char IICINTM:1;
            unsigned char IICCSC:1;
            unsigned char :3;
            unsigned char IICACKT:1;
            unsigned char :2;
        } BIT;
    } SIMR2;
    union {
        unsigned char BYTE;
        struct {
            unsigned char IICSTAREQ:1;
            unsigned char IICRSTAREQ:1;
            unsigned char IICSTPREQ:1;
            unsigned char IICSTIF:1;
            unsigned char IICSDAS:2;
            unsigned char IICSCLS:2;
        } BIT;
    } SIMR3;
    union {
        unsigned char BYTE;
        struct {
            unsigned char IICACKR:1;
            unsigned char :7;
        } BIT;
    } SISR;
    union {
        unsigned char BYTE;
        struct {
            unsigned char SSE:1;
            unsigned char CTSE:1;
            unsigned char MSS:1;
            unsigned char :1;
            unsigned char MFF:1;
            unsigned char :1;
            unsigned char CKPOL:1;
            unsigned char CKPH:1;
        } BIT;
    } SPMR;
};

struct st_sci12 {
    union {
        unsigned char BYTE;
        struct {
            unsigned char CKS:2;
            unsigned char MP:1;
            unsigned char STOP:1;
            unsigned char PM:1;
            unsigned char PE:1;
            unsigned char CHR:1;
            unsigned char CM:1;
        } BIT;
    } SMR;
    unsigned char  BRR;
    union {
        unsigned char BYTE;
        struct {
            unsigned char CKE:2;
            unsigned char TEIE:1;
            unsigned char MPIE:1;
            unsigned char RE:1;
            unsigned char TE:1;
            unsigned char RIE:1;
            unsigned char TIE:1;
        } BIT;
    } SCR;
    unsigned char  TDR;
    union {
        unsigned char BYTE;
        struct {
            unsigned char MPBT:1;
            unsigned char MPB:1;
            unsigned char TEND:1;
            unsigned char PER:1;
            unsigned char FER:1;
            unsigned char ORER:1;
            unsigned char :2;
        } BIT;
    } SSR;
    unsigned char  RDR;
    union {
        unsigned char BYTE;
        struct {
            unsigned char SMIF:1;
            unsigned char :1;
            unsigned char SINV:1;
            unsigned char SDIR:1;
            unsigned char :3;
            unsigned char BCP2:1;
        } BIT;
    } SCMR;
    union {
        unsigned char BYTE;
        struct {
            unsigned char ACS0:1;
            unsigned char :3;
            unsigned char ABCS:1;
            unsigned char NFEN:1;
            unsigned char :1;
            unsigned char RXDESEL:1;
        } BIT;
    } SEMR;
    union {
        unsigned char BYTE;
        struct {
            unsigned char NFCS:3;
            unsigned char :5;
        } BIT;
    } SNFR;
    union {
        unsigned char BYTE;
        struct {
            unsigned char IICM:1;
            unsigned char :2;
            unsigned char IICDL:5;
        } BIT;
    } SIMR1;
    union {
        unsigned char BYTE;
        struct {
            unsigned char IICINTM:1;
            unsigned char IICCSC:1;
            unsigned char :3;
            unsigned char IICACKT:1;
            unsigned char :2;
        } BIT;
    } SIMR2;
    union {
        unsigned char BYTE;
        struct {
            unsigned char IICSTAREQ:1;
            unsigned char IICRSTAREQ:1;
            unsigned char IICSTPREQ:1;
            unsigned char IICSTIF:1;
            unsigned char IICSDAS:2;
            unsigned char IICSCLS:2;
        } BIT;
    } SIMR3;
    union {
        unsigned char BYTE;
        struct {
            unsigned char IICACKR:1;
            unsigned char :7;
        } BIT;
    } SISR;
    union {
        unsigned char BYTE;
        struct {
            unsigned char SSE:1;
            unsigned char CTSE:1;
            unsigned char MSS:1;
            unsigned char :1;
            unsigned char MFF:1;
            unsigned char :1;
            unsigned char CKPOL:1;
            unsigned char CKPH:1;
        } BIT;
    } SPMR;
    char           wk0[18];
    union {
        unsigned char BYTE;
        struct {
            unsigned char ESME:1;
            unsigned char :7;
        } BIT;
    } ESMER;
    union {
        unsigned char BYTE;
        struct {
            unsigned char :1;		
            unsigned char SFSF:1;
            unsigned char RXDSF:1;
            unsigned char BRME:1;
            unsigned char :4;
        } BIT;
    } CR0;
    union {
        unsigned char BYTE;
        struct {
            unsigned char BFE:1;
            unsigned char CF0RE:1;
            unsigned char CF1DS:2;
            unsigned char PIBE:1;
            unsigned char PIBS:3;
        } BIT;
    } CR1;
    union {
        unsigned char BYTE;
        struct {
            unsigned char DFCS:3;
            unsigned char :1;
            unsigned char BCCS:2;
            unsigned char RTS:2;
        } BIT;
    } CR2;
    union {
        unsigned char BYTE;
        struct {
            unsigned char SDST:1;
            unsigned char :7;
        } BIT;
    } CR3;
    union {
        unsigned char BYTE;
        struct {
            unsigned char TXDXPS:1;
            unsigned char RXDXPS:1;
            unsigned char :2;
            unsigned char SHARPS:1;
            unsigned char :3;
        } BIT;
    } PCR;
    union {
        unsigned char BYTE;
        struct {
            unsigned char BFDIE:1;
            unsigned char CF0MIE:1;
            unsigned char CF1MIE:1;
            unsigned char PIBDIE:1;
            unsigned char BCDIE:1;
            unsigned char AEDIE:1;
            unsigned char :2;
        } BIT;
    } ICR;
    union {
        unsigned char BYTE;
        struct {
            unsigned char BFDF:1;
            unsigned char CF0MF:1;
            unsigned char CF1MF:1;
            unsigned char PIBDF:1;
            unsigned char BCDF:1;
            unsigned char AEDF:1;
            unsigned char :2;
        } BIT;
    } STR;
    union {
        unsigned char BYTE;
        struct {
            unsigned char BFDCL:1;
            unsigned char CF0MCL:1;
            unsigned char CF1MCL:1;
            unsigned char PIBDCL:1;
            unsigned char BCDCL:1;
            unsigned char AEDCL:1;
            unsigned char :2;
        } BIT;
    } STCR;
    unsigned char  CF0DR;
    union {
        unsigned char BYTE;
        struct {
            unsigned char CF0CE0:1;
            unsigned char CF0CE1:1;
            unsigned char CF0CE2:1;
            unsigned char CF0CE3:1;
            unsigned char CF0CE4:1;
            unsigned char CF0CE5:1;
            unsigned char CF0CE6:1;
            unsigned char CF0CE7:1;
        } BIT;
    } CF0CR;
    unsigned char  CF0RR;
    unsigned char  PCF1DR;
    unsigned char  SCF1DR;
    union {
        unsigned char BYTE;
        struct {
            unsigned char CF1CE0:1;
            unsigned char CF1CE1:1;
            unsigned char CF1CE2:1;
            unsigned char CF1CE3:1;
            unsigned char CF1CE4:1;
            unsigned char CF1CE5:1;
            unsigned char CF1CE6:1;
            unsigned char CF1CE7:1;
        } BIT;
    } CF1CR;
    unsigned char  CF1RR;
    union {
        unsigned char BYTE;
        struct {
            unsigned char TCST:1;
            unsigned char :7;
        } BIT;
    } TCR;
    union {
        unsigned char BYTE;
        struct {
            unsigned char TOMS:2;
            unsigned char :1;
            unsigned char TWRC:1;
            unsigned char TCSS:3;
            unsigned char :1;
        } BIT;
    } TMR;
    unsigned char  TPRE;
    unsigned char  TCNT;
};

