AndEmi81/indesit_inertia_rx210/HAL/RN_RX100/RN_RX100_reg.h
struct st_smci {
    union {
        unsigned char BYTE;
        struct {
            unsigned char CKS:2;
            unsigned char BCP:2;
            unsigned char PM:1;
            unsigned char PE:1;
            unsigned char BLK:1;
            unsigned char GM:1;
        } BIT;
    } SMR;
    unsigned char  BRR;
    union {
        unsigned char BYTE;
        struct {
            unsigned char CKE:2;
            unsigned char TEIE:1;
            unsigned char MPIE:1;
            unsigned char RE:1;
            unsigned char TE:1;
            unsigned char RIE:1;
            unsigned char TIE:1;
        } BIT;
    } SCR;
    unsigned char  TDR;
    union {
        unsigned char BYTE;
        struct {
            unsigned char MPBT:1;
            unsigned char MPB:1;
            unsigned char TEND:1;
            unsigned char PER:1;
            unsigned char ERS:1;
            unsigned char ORER:1;
            unsigned char :2;
        } BIT;
    } SSR;
    unsigned char  RDR;
    union {
        unsigned char BYTE;
        struct {
            unsigned char SMIF:1;
            unsigned char :1;
            unsigned char SINV:1;
            unsigned char SDIR:1;
            unsigned char :3;
            unsigned char BCP2:1;
        } BIT;
    } SCMR;
};

struct st_system {
    union {
        unsigned short WORD;
        struct {
            unsigned short MD:1;
            unsigned short :15;
        } BIT;
    } MDMONR;
    char           wk0[6];
    union {
        unsigned short WORD;
        struct {
            unsigned short RAME:1;
            unsigned short :15;
        } BIT;
    } SYSCR1;
    char           wk1[2];
    union {
        unsigned short WORD;
        struct {
            unsigned short :15;
            unsigned short SSBY:1;
        } BIT;
    } SBYCR;
    char           wk2[2];
    union {
        unsigned long LONG;
        struct {
            unsigned long :9;
            unsigned long MSTPA9:1;
            unsigned long :5;
            unsigned long MSTPA15:1;
            unsigned long :1;
            unsigned long MSTPA17:1;
            unsigned long :10;
            unsigned long MSTPA28:1;
            unsigned long :3;
        } BIT;
    } MSTPCRA;
    union {
        unsigned long LONG;
        struct {
            unsigned long :4;
            unsigned long MSTPB4:1;
            unsigned long :1;
            unsigned long MSTPB6:1;
            unsigned long :10;
            unsigned long MSTPB17:1;
            unsigned long :3;
            unsigned long MSTPB21:1;
            unsigned long :1;
            unsigned long MSTPB23:1;
            unsigned long :2;
            unsigned long MSTPB26:1;
            unsigned long :3;
            unsigned long MSTPB30:1;
            unsigned long :1;
        } BIT;
    } MSTPCRB;
    union {
        unsigned long LONG;
        struct {
            unsigned long MSTPC0:1;
            unsigned long :18;
            unsigned long MSTPC19:1;
            unsigned long :11;
            unsigned long DSLPE:1;
        } BIT;
    } MSTPCRC;
    char           wk3[4];
    union {
        unsigned long LONG;
        struct {
            unsigned long PCKD:4;
            unsigned long :4;
            unsigned long PCKB:4;
            unsigned long :12;
            unsigned long ICK:4;
            unsigned long FCK:4;
        } BIT;
    } SCKCR;
    char           wk4[2];
    union {
        unsigned short WORD;
        struct {
            unsigned short CKSEL:3;
            unsigned short :5;
        } BIT;
    } SCKCR3;
    char           wk5[10];
    union {
        unsigned char BYTE;
        struct {
            unsigned char MOSTP:1;
            unsigned char :7;
        } BIT;
    } MOSCCR;
    union {
        unsigned char BYTE;
        struct {
            unsigned char SOSTP:1;
            unsigned char :7;
        } BIT;
    } SOSCCR;
    union {
        unsigned char BYTE;
        struct {
            unsigned char LCSTP:1;
            unsigned char :7;
        } BIT;
    } LOCOCR;
    union {
        unsigned char BYTE;
        struct {
            unsigned char ILCSTP:1;
            unsigned char :7;
        } BIT;
    } ILOCOCR;
    union {
        unsigned char BYTE;
        struct {
            unsigned char HCSTP:1;
            unsigned char :7;
        } BIT;
    } HOCOCR;
    char           wk6[5];
    union {
        unsigned char BYTE;
        struct {
            unsigned char MOOVF:1;
            unsigned char :2;
            unsigned char HCOVF:1;
            unsigned char :4;
        } BIT;
    } OSCOVFSR;
    char           wk7[1];
    union {
        unsigned short WORD;
        struct {
            unsigned short :8;
            unsigned short CKOSEL:3;
            unsigned short :1;
            unsigned short CKODIV:3;
            unsigned short CKOSTP:1;
        } BIT;
    } CKOCR;
    union {
        unsigned char BYTE;
        struct {
            unsigned char OSTDIE:1;
            unsigned char :6;
            unsigned char OSTDE:1;
        } BIT;
    } OSTDCR;
    union {
        unsigned char BYTE;
        struct {
            unsigned char OSTDF:1;
            unsigned char :7;
        } BIT;
    } OSTDSR;
    char           wk8[94];
    union {
        unsigned char BYTE;
        struct {
            unsigned char OPCM:3;
            unsigned char :1;
            unsigned char OPCMTSF:1;
            unsigned char :3;
        } BIT;
    } OPCCR;
    union {
        unsigned char BYTE;
        struct {
            unsigned char RSTCKSEL:3;
            unsigned char :4;
            unsigned char RSTCKEN:1;
        } BIT;
    } RSTCKCR;
    union {
        unsigned char BYTE;
        struct {
            unsigned char MSTS:5;
            unsigned char :3;
        } BIT;
    } MOSCWTCR;
    char           wk9[2];
    union {
        unsigned char BYTE;
        struct {
            unsigned char HSTS:5;
            unsigned char :3;
        } BIT;
    } HOCOWTCR;
    char           wk10[4];
    union {
        unsigned char BYTE;
        struct {
            unsigned char SOPCM:1;
            unsigned char :3;
            unsigned char SOPCMTSF:1;
            unsigned char :3;
        } BIT;
    } SOPCCR;
    char           wk11[21];
    union {
        unsigned char BYTE;
        struct {
            unsigned char IWDTRF:1;
            unsigned char :1;
            unsigned char SWRF:1;
            unsigned char :5;
        } BIT;
    } RSTSR2;
    char           wk12[1];
    unsigned short SWRR;
    char           wk13[28];
    union {
        unsigned char BYTE;
        struct {
            unsigned char LVD1IDTSEL:2;
            unsigned char LVD1IRQSEL:1;
            unsigned char :5;
        } BIT;
    } LVD1CR1;
    union {
        unsigned char BYTE;
        struct {
            unsigned char LVD1DET:1;
            unsigned char LVD1MON:1;
            unsigned char :6;
        } BIT;
    } LVD1SR;
    union {
        unsigned char BYTE;
        struct {
            unsigned char LVD2IDTSEL:2;
            unsigned char LVD2IRQSEL:1;
            unsigned char :5;
        } BIT;
    } LVD2CR1;
    union {
        unsigned char BYTE;
        struct {
            unsigned char LVD2DET:1;
            unsigned char LVD2MON:1;
            unsigned char :6;
        } BIT;
    } LVD2SR;
    char           wk14[794];
    union {
        unsigned short WORD;
        struct {
            unsigned short PRC0:1;
            unsigned short PRC1:1;
            unsigned short PRC2:1;
            unsigned short PRC3:1;
            unsigned short :4;
            unsigned short PRKEY:8;
        } BIT;
    } PRCR;
    char           wk15[48784];
    union {
        unsigned char BYTE;
        struct {
            unsigned char PORF:1;
            unsigned char :1;
            unsigned char LVD1RF:1;
            unsigned char LVD2RF:1;
            unsigned char :4;
        } BIT;
    } RSTSR0;
    union {
        unsigned char BYTE;
        struct {
            unsigned char CWSF:1;
            unsigned char :7;
        } BIT;
    } RSTSR1;
    char           wk16[1];
    union {
        unsigned char BYTE;
        struct {
            unsigned char :5;
            unsigned char MODRV21:1;
            unsigned char MOSEL:1;
            unsigned char :1;
        } BIT;
    } MOFCR;
    char           wk17[3];
    union {
        unsigned char BYTE;
        struct {
            unsigned char :3;
            unsigned char EXVCCINP2:1;
            unsigned char :1;
            unsigned char LVD1E:1;
            unsigned char LVD2E:1;
            unsigned char :1;
        } BIT;
    } LVCMPCR;
    union {
        unsigned char BYTE;
        struct {
            unsigned char LVD1LVL:4;
            unsigned char LVD2LVL:2;
            unsigned char :2;
        } BIT;
    } LVDLVLR;
    char           wk18[1];
    union {
        unsigned char BYTE;
        struct {
            unsigned char LVD1RIE:1;
            unsigned char :1;
            unsigned char LVD1CMPE:1;
            unsigned char :3;
            unsigned char LVD1RI:1;
            unsigned char LVD1RN:1;
        } BIT;
    } LVD1CR0;
    union {
        unsigned char BYTE;
        struct {
            unsigned char LVD2RIE:1;
            unsigned char :1;
            unsigned char LVD2CMPE:1;
            unsigned char :3;
            unsigned char LVD2RI:1;
            unsigned char LVD2RN:1;
        } BIT;
    } LVD2CR0;
};
#elif __RX_BIG_ENDIAN__        /*Big endian*/
struct st_bsc {
    union {
        unsigned char BYTE;
        struct {
            unsigned char :7;
            unsigned char STSCLR:1;
        } BIT;
    } BERCLR;
    char           wk0[3];
    union {
        unsigned char BYTE;
        struct {
            unsigned char :7;
            unsigned char IGAEN:1;
        } BIT;
    } BEREN;
    char           wk1[3];
    union {
        unsigned char BYTE;
        struct {
            unsigned char :1;
            unsigned char MST:3;
            unsigned char :3;
            unsigned char IA:1;
        } BIT;
    } BERSR1;
    char           wk2[1];
    union {
        unsigned short WORD;
        struct {
            unsigned short ADDR:13;
        } BIT;
    } BERSR2;
    char           wk3[4];
    union {
        unsigned short WORD;
        struct {
            unsigned short :4;
            unsigned short BPFB:2;
            unsigned short :2;
            unsigned short BPGB:2;
            unsigned short BPIB:2;
            unsigned short BPRO:2;
            unsigned short BPRA:2;
        } BIT;
    } BUSPRI;
};

struct st_cac {
    union {
        unsigned char BYTE;
        struct {
            unsigned char :7;
            unsigned char CFME:1;
        } BIT;
    } CACR0;
    union {
        unsigned char BYTE;
        struct {
            unsigned char EDGES:2;
            unsigned char TCSS:2;
            unsigned char FMCS:3;
            unsigned char CACREFE:1;
        } BIT;
    } CACR1;
    union {
        unsigned char BYTE;
        struct {
            unsigned char DFS:2;
            unsigned char RCDS:2;
            unsigned char RSCS:3;
            unsigned char RPS:1;
        } BIT;
    } CACR2;
    union {
        unsigned char BYTE;
        struct {
            unsigned char :1;
            unsigned char OVFFCL:1;
            unsigned char MENDFCL:1;
            unsigned char FERRFCL:1;
            unsigned char :1;
            unsigned char OVFIE:1;
            unsigned char MENDIE:1;
            unsigned char FERRIE:1;
        } BIT;
    } CAICR;
    union {
        unsigned char BYTE;
        struct {
            unsigned char :5;
            unsigned char OVFF:1;
            unsigned char MENDF:1;
            unsigned char FERRF:1;
        } BIT;
    } CASTR;
    char           wk0[1];
    unsigned short CAULVR;
    unsigned short CALLVR;
    unsigned short CACNTBR;
};

struct st_cmt {
    union {
        unsigned short WORD;
        struct {
            unsigned short :14;
            unsigned short STR1:1;
            unsigned short STR0:1;
        } BIT;
    } CMSTR0;
};

struct st_cmt0 {
    union {
        unsigned short WORD;
        struct {
            unsigned short :9;
            unsigned short CMIE:1;
            unsigned short :4;
            unsigned short CKS:2;
        } BIT;
    } CMCR;
    unsigned short CMCNT;
    unsigned short CMCOR;
};

struct st_crc {
    union {
        unsigned char BYTE;
        struct {
            unsigned char DORCLR:1;
            unsigned char :4;
            unsigned char LMS:1;
            unsigned char GPS:2;
        } BIT;
    } CRCCR;
    unsigned char  CRCDIR;
    unsigned short CRCDOR;
};

struct st_doc {
    union {
        unsigned char BYTE;
        struct {
            unsigned char :1;
            unsigned char DOPCFCL:1;
            unsigned char DOPCF:1;
            unsigned char DOPCIE:1;
            unsigned char :1;
            unsigned char DCSEL:1;
            unsigned char OMS:2;
        } BIT;
    } DOCR;
    char           wk0[1];
    unsigned short DODIR;
    unsigned short DODSR;
};

struct st_dtc {
    union {
        unsigned char BYTE;
        struct {
            unsigned char :3;
            unsigned char RRS:1;
        } BIT;
    } DTCCR;
    char           wk0[3];
    void          *DTCVBR;
    union {
        unsigned char BYTE;
        struct {
            unsigned char :7;
            unsigned char SHORT:1;
        } BIT;
    } DTCADMOD;
    char           wk1[3];
    union {
        unsigned char BYTE;
        struct {
            unsigned char :7;
            unsigned char DTCST:1;
        } BIT;
    } DTCST;
    char           wk2[1];
    union {
        unsigned short WORD;
        struct {
            unsigned short ACT:1;
            unsigned short :7;
            unsigned short VECN:8;
        } BIT;
    } DTCSTS;
};
struct st_flash {
    union {
        unsigned char BYTE;
        struct {
            unsigned char :7;
            unsigned char DFLEN:1;
        } BIT;
    } DFLCTL;
};
struct st_icu {
    union {
        unsigned char BYTE;
        struct {
            unsigned char :7;
            unsigned char IR:1;
        } BIT;
    } IR[250];
    char           wk0[6];
    union {
        unsigned char BYTE;
        struct {
            unsigned char :7;
            unsigned char DTCE:1;
        } BIT;
    } DTCER[249];
    char           wk1[7];
    union {
        unsigned char BYTE;
        struct {
            unsigned char IEN7:1;
            unsigned char IEN6:1;
            unsigned char IEN5:1;
            unsigned char IEN4:1;
            unsigned char IEN3:1;
            unsigned char IEN2:1;
            unsigned char IEN1:1;
            unsigned char IEN0:1;
        } BIT;
    } IER[32];
    char           wk2[192];
    union {
        unsigned char BYTE;
        struct {
            unsigned char :7;
            unsigned char SWINT:1;
        } BIT;
    } SWINTR;
    char           wk3[15];
    union {
        unsigned short WORD;
        struct {
            unsigned short FIEN:1;
            unsigned short :7;
            unsigned short FVCT:8;
        } BIT;
    } FIR;
    char           wk4[14];
    union {
        unsigned char BYTE;
        struct {
            unsigned char :4;
            unsigned char IPR:4;
        } BIT;
    } IPR[250];
    char           wk5[262];
    union {
        unsigned char BYTE;
        struct {
            unsigned char :4;
            unsigned char IRQMD:2;
        } BIT;
    } IRQCR[8];
    char           wk6[8];
    union {
        unsigned char BYTE;
        struct {
            unsigned char FLTEN7:1;
            unsigned char FLTEN6:1;
            unsigned char FLTEN5:1;
            unsigned char FLTEN4:1;
            unsigned char FLTEN3:1;
            unsigned char FLTEN2:1;
            unsigned char FLTEN1:1;
            unsigned char FLTEN0:1;
        } BIT;
    } IRQFLTE0;
    char           wk7[3];
    union {
        unsigned short WORD;
        struct {
            unsigned short FCLKSEL7:2;
            unsigned short FCLKSEL6:2;
            unsigned short FCLKSEL5:2;
            unsigned short FCLKSEL4:2;
            unsigned short FCLKSEL3:2;
            unsigned short FCLKSEL2:2;
            unsigned short FCLKSEL1:2;
            unsigned short FCLKSEL0:2;
        } BIT;
    } IRQFLTC0;
    char           wk8[106];
    union {
        unsigned char BYTE;
        struct {
            unsigned char :2;
            unsigned char LVD2ST:1;
            unsigned char LVD1ST:1;
            unsigned char IWDTST:1;
            unsigned char :1;
            unsigned char OSTST:1;
            unsigned char NMIST:1;
        } BIT;
    } NMISR;
    union {
        unsigned char BYTE;
        struct {
            unsigned char :2;
            unsigned char LVD2EN:1;
            unsigned char LVD1EN:1;
            unsigned char IWDTEN:1;
            unsigned char :1;
            unsigned char OSTEN:1;
            unsigned char NMIEN:1;
        } BIT;
    } NMIER;
    union {
        unsigned char BYTE;
        struct {
            unsigned char :2;
            unsigned char LVD2CLR:1;
            unsigned char LVD1CLR:1;
            unsigned char IWDTCLR:1;
            unsigned char :1;
            unsigned char OSTCLR:1;
            unsigned char NMICLR:1;
        } BIT;
    } NMICLR;
    union {
        unsigned char BYTE;
        struct {
            unsigned char :4;
            unsigned char NMIMD:1;
        } BIT;
    } NMICR;
    char           wk9[12];
    union {
        unsigned char BYTE;
        struct {
            unsigned char :7;
            unsigned char NFLTEN:1;
        } BIT;
    } NMIFLTE;
    char           wk10[3];
    union {
        unsigned char BYTE;
        struct {
            unsigned char :6;
            unsigned char NFCLKSEL:2;
        } BIT;
    } NMIFLTC;
};

