AndEmi81/indesit_inertia_rx210/HAL/RN_RX100/RN_RX100_reg.h
enum enum_ier {
IER_BSC_BUSERR=0x02,
IER_ICU_SWINT=0x03,
IER_CMT0_CMI0=0x03,
IER_CMT1_CMI1=0x03,
IER_CAC_FERRF=0x04,IER_CAC_MENDF=0x04,IER_CAC_OVFF=0x04,
IER_RSPI0_SPEI0=0x05,IER_RSPI0_SPRI0=0x05,IER_RSPI0_SPTI0=0x05,IER_RSPI0_SPII0=0x05,
IER_DOC_DOPCF=0x07,
IER_RTC_CUP=0x07,
IER_ICU_IRQ0=0x08,IER_ICU_IRQ1=0x08,IER_ICU_IRQ2=0x08,IER_ICU_IRQ3=0x08,IER_ICU_IRQ4=0x08,IER_ICU_IRQ5=0x08,IER_ICU_IRQ6=0x08,IER_ICU_IRQ7=0x08,
IER_LVD_LVD1=0x0B,IER_LVD_LVD2=0x0B,
IER_RTC_ALM=0x0B,IER_RTC_PRD=0x0B,
IER_S12AD_S12ADI0=0x0C,IER_S12AD_GBADI=0x0C,
IER_MTU0_TGIA0=0x0E,IER_MTU0_TGIB0=0x0E,IER_MTU0_TGIC0=0x0E,IER_MTU0_TGID0=0x0E,IER_MTU0_TCIV0=0x0E,IER_MTU0_TGIE0=0x0E,IER_MTU0_TGIF0=0x0F,
IER_MTU1_TGIA1=0x0F,IER_MTU1_TGIB1=0x0F,IER_MTU1_TCIV1=0x0F,IER_MTU1_TCIU1=0x0F,
IER_MTU2_TGIA2=0x0F,IER_MTU2_TGIB2=0x0F,IER_MTU2_TCIV2=0x0F,IER_MTU2_TCIU2=0x10,
IER_MTU5_TGIU5=0x11,IER_MTU5_TGIV5=0x11,IER_MTU5_TGIW5=0x11,
IER_SCI1_ERI1=0x1B,IER_SCI1_RXI1=0x1B,IER_SCI1_TXI1=0x1B,IER_SCI1_TEI1=0x1B,
IER_SCI5_ERI5=0x1B,IER_SCI5_RXI5=0x1B,IER_SCI5_TXI5=0x1C,IER_SCI5_TEI5=0x1C,
IER_SCI12_ERI12=0x1D,IER_SCI12_RXI12=0x1D,IER_SCI12_TXI12=0x1E,IER_SCI12_TEI12=0x1E,IER_SCI12_SCIX0=0x1E,IER_SCI12_SCIX1=0x1E,IER_SCI12_SCIX2=0x1E,IER_SCI12_SCIX3=0x1E,
IER_RIIC0_EEI0=0x1E,IER_RIIC0_RXI0=0x1E,IER_RIIC0_TXI0=0x1F,IER_RIIC0_TEI0=0x1F
};

enum enum_ipr {
IPR_BSC_BUSERR=0,
IPR_ICU_SWINT=3,
IPR_CMT0_CMI0=4,
IPR_CMT1_CMI1=5,
IPR_CAC_FERRF=32,IPR_CAC_MENDF=33,IPR_CAC_OVFF=34,
IPR_RSPI0_SPEI0=44,IPR_RSPI0_SPRI0=44,IPR_RSPI0_SPTI0=44,IPR_RSPI0_SPII0=44,
IPR_DOC_DOPCF=57,
IPR_RTC_CUP=63,
IPR_ICU_IRQ0=64,IPR_ICU_IRQ1=65,IPR_ICU_IRQ2=66,IPR_ICU_IRQ3=67,IPR_ICU_IRQ4=68,IPR_ICU_IRQ5=69,IPR_ICU_IRQ6=70,IPR_ICU_IRQ7=71,
IPR_LVD_LVD1=88,IPR_LVD_LVD2=89,
IPR_RTC_ALM=92,IPR_RTC_PRD=93,
IPR_S12AD_S12ADI0=102,IPR_S12AD_GBADI=103,
IPR_MTU0_TGIA0=114,IPR_MTU0_TGIB0=114,IPR_MTU0_TGIC0=114,IPR_MTU0_TGID0=114,IPR_MTU0_TCIV0=118,IPR_MTU0_TGIE0=118,IPR_MTU0_TGIF0=118,
IPR_MTU1_TGIA1=121,IPR_MTU1_TGIB1=121,IPR_MTU1_TCIV1=123,IPR_MTU1_TCIU1=123,
IPR_MTU2_TGIA2=125,IPR_MTU2_TGIB2=125,IPR_MTU2_TCIV2=127,IPR_MTU2_TCIU2=127,
IPR_MTU5_TGIU5=139,IPR_MTU5_TGIV5=139,IPR_MTU5_TGIW5=139,
IPR_SCI1_ERI1=218,IPR_SCI1_RXI1=218,IPR_SCI1_TXI1=218,IPR_SCI1_TEI1=218,
IPR_SCI5_ERI5=222,IPR_SCI5_RXI5=222,IPR_SCI5_TXI5=222,IPR_SCI5_TEI5=222,
IPR_SCI12_ERI12=238,IPR_SCI12_RXI12=238,IPR_SCI12_TXI12=238,IPR_SCI12_TEI12=238,IPR_SCI12_SCIX0=242,IPR_SCI12_SCIX1=243,IPR_SCI12_SCIX2=244,IPR_SCI12_SCIX3=245,
IPR_RIIC0_EEI0=246,IPR_RIIC0_RXI0=247,IPR_RIIC0_TXI0=248,IPR_RIIC0_TEI0=249,
IPR_BSC_=0,
IPR_CMT0_=4,
IPR_CMT1_=5,
IPR_RSPI0_=44,
IPR_DOC_=57,
IPR_ELC_=106,
IPR_MTU1_TGI=121,
IPR_MTU1_TCI=123,
IPR_MTU2_TGI=125,
IPR_MTU2_TCI=127,
IPR_MTU5_=139,
IPR_MTU5_TGI=139,
IPR_SCI1_=218,
IPR_SCI5_=222
};

#define    IEN_BSC_BUSERR        IEN0
#define    IEN_ICU_SWINT        IEN3
#define    IEN_CMT0_CMI0        IEN4
#define    IEN_CMT1_CMI1        IEN5
#define    IEN_CAC_FERRF        IEN0
#define    IEN_CAC_MENDF        IEN1
#define    IEN_CAC_OVFF        IEN2
#define    IEN_RSPI0_SPEI0        IEN4
#define    IEN_RSPI0_SPRI0        IEN5
#define    IEN_RSPI0_SPTI0        IEN6
#define    IEN_RSPI0_SPII0        IEN7
#define    IEN_DOC_DOPCF        IEN1
#define    IEN_RTC_CUP            IEN7
#define    IEN_ICU_IRQ0        IEN0
#define    IEN_ICU_IRQ1        IEN1
#define    IEN_ICU_IRQ2        IEN2
#define    IEN_ICU_IRQ3        IEN3
#define    IEN_ICU_IRQ4        IEN4
#define    IEN_ICU_IRQ5        IEN5
#define    IEN_ICU_IRQ6        IEN6
#define    IEN_ICU_IRQ7        IEN7
#define    IEN_LVD_LVD1        IEN0
#define    IEN_LVD_LVD2        IEN1
#define    IEN_RTC_ALM            IEN4
#define    IEN_RTC_PRD            IEN5
#define    IEN_S12AD_S12ADI0    IEN6
#define    IEN_S12AD_GBADI        IEN7
#define    IEN_MTU0_TGIA0        IEN2
#define    IEN_MTU0_TGIB0        IEN3
#define    IEN_MTU0_TGIC0        IEN4
#define    IEN_MTU0_TGID0        IEN5
#define    IEN_MTU0_TCIV0        IEN6
#define    IEN_MTU0_TGIE0        IEN7
#define    IEN_MTU0_TGIF0        IEN0
#define    IEN_MTU1_TGIA1        IEN1
#define    IEN_MTU1_TGIB1        IEN2
#define    IEN_MTU1_TCIV1        IEN3
#define    IEN_MTU1_TCIU1        IEN4
#define    IEN_MTU2_TGIA2        IEN5
#define    IEN_MTU2_TGIB2        IEN6
#define    IEN_MTU2_TCIV2        IEN7
#define    IEN_MTU2_TCIU2        IEN0
#define    IEN_MTU5_TGIU5        IEN3
#define    IEN_MTU5_TGIV5        IEN4
#define    IEN_MTU5_TGIW5        IEN5
#define    IEN_SCI1_ERI1        IEN2
#define    IEN_SCI1_RXI1        IEN3
#define    IEN_SCI1_TXI1        IEN4
#define    IEN_SCI1_TEI1        IEN5
#define    IEN_SCI5_ERI5        IEN6
#define    IEN_SCI5_RXI5        IEN7
#define    IEN_SCI5_TXI5        IEN0
#define    IEN_SCI5_TEI5        IEN1
#define    IEN_SCI12_ERI12        IEN6
#define    IEN_SCI12_RXI12        IEN7
#define    IEN_SCI12_TXI12        IEN0
#define    IEN_SCI12_TEI12        IEN1
#define    IEN_SCI12_SCIX0        IEN2
#define    IEN_SCI12_SCIX1        IEN3
#define    IEN_SCI12_SCIX2        IEN4
#define    IEN_SCI12_SCIX3        IEN5
#define    IEN_RIIC0_EEI0        IEN6
#define    IEN_RIIC0_RXI0        IEN7
#define    IEN_RIIC0_TXI0        IEN0
#define    IEN_RIIC0_TEI0        IEN1

#define    VECT_BSC_BUSERR        16
#define    VECT_ICU_SWINT        27
#define    VECT_CMT0_CMI0        28
#define    VECT_CMT1_CMI1        29
#define    VECT_CAC_FERRF        32
#define    VECT_CAC_MENDF        33
#define    VECT_CAC_OVFF        34
#define    VECT_RSPI0_SPEI0    44
#define    VECT_RSPI0_SPRI0    45
#define    VECT_RSPI0_SPTI0    46
#define    VECT_RSPI0_SPII0    47
#define    VECT_DOC_DOPCF        57
#define    VECT_RTC_CUP        63
#define    VECT_ICU_IRQ0        64
#define    VECT_ICU_IRQ1        65
#define    VECT_ICU_IRQ2        66
#define    VECT_ICU_IRQ3        67
#define    VECT_ICU_IRQ4        68
#define    VECT_ICU_IRQ5        69
#define    VECT_ICU_IRQ6        70
#define    VECT_ICU_IRQ7        71
#define    VECT_LVD_LVD1        88
#define    VECT_LVD_LVD2        89
#define    VECT_RTC_ALM        92
#define    VECT_RTC_PRD        93
#define    VECT_S12AD_S12ADI0    102
#define    VECT_S12AD_GBADI    103
#define    VECT_MTU0_TGIA0        114
#define    VECT_MTU0_TGIB0        115
#define    VECT_MTU0_TGIC0        116
#define    VECT_MTU0_TGID0        117
#define    VECT_MTU0_TCIV0        118
#define    VECT_MTU0_TGIE0        119
#define    VECT_MTU0_TGIF0        120
#define    VECT_MTU1_TGIA1        121
#define    VECT_MTU1_TGIB1        122
#define    VECT_MTU1_TCIV1        123
#define    VECT_MTU1_TCIU1        124
#define    VECT_MTU2_TGIA2        125
#define    VECT_MTU2_TGIB2        126
#define    VECT_MTU2_TCIV2        127
#define    VECT_MTU2_TCIU2        128
#define    VECT_MTU5_TGIU5        139
#define    VECT_MTU5_TGIV5        140
#define    VECT_MTU5_TGIW5        141
#define    VECT_SCI1_ERI1        218
#define    VECT_SCI1_RXI1        219
#define    VECT_SCI1_TXI1        220
#define    VECT_SCI1_TEI1        221
#define    VECT_SCI5_ERI5        222
#define    VECT_SCI5_RXI5        223
#define    VECT_SCI5_TXI5        224
#define    VECT_SCI5_TEI5        225
#define    VECT_SCI12_ERI12    238
#define    VECT_SCI12_RXI12    239
#define    VECT_SCI12_TXI12    240
#define    VECT_SCI12_TEI12    241
#define    VECT_SCI12_SCIX0    242
#define    VECT_SCI12_SCIX1    243
#define    VECT_SCI12_SCIX2    244
#define    VECT_SCI12_SCIX3    245
#define    VECT_RIIC0_EEI0        246
#define    VECT_RIIC0_RXI0        247
#define    VECT_RIIC0_TXI0        248
#define    VECT_RIIC0_TEI0        249

#define    MSTP_DTC    SYSTEM.MSTPCRA.BIT.MSTPA28
#define    MSTP_S12AD    SYSTEM.MSTPCRA.BIT.MSTPA17
#define    MSTP_CMT    SYSTEM.MSTPCRA.BIT.MSTPA15
#define    MSTP_CMT0    SYSTEM.MSTPCRA.BIT.MSTPA15
#define    MSTP_CMT1    SYSTEM.MSTPCRA.BIT.MSTPA15
#define    MSTP_MTU    SYSTEM.MSTPCRA.BIT.MSTPA9
#define    MSTP_MTU0    SYSTEM.MSTPCRA.BIT.MSTPA9
#define    MSTP_MTU1    SYSTEM.MSTPCRA.BIT.MSTPA9
#define    MSTP_MTU2    SYSTEM.MSTPCRA.BIT.MSTPA9
#define    MSTP_MTU5    SYSTEM.MSTPCRA.BIT.MSTPA9
#define    MSTP_SCI1    SYSTEM.MSTPCRB.BIT.MSTPB30
#define    MSTP_SMCI1    SYSTEM.MSTPCRB.BIT.MSTPB30
#define    MSTP_SCI5    SYSTEM.MSTPCRB.BIT.MSTPB26
#define    MSTP_SMCI5    SYSTEM.MSTPCRB.BIT.MSTPB26
#define    MSTP_CRC    SYSTEM.MSTPCRB.BIT.MSTPB23
#define    MSTP_RIIC0    SYSTEM.MSTPCRB.BIT.MSTPB21
#define    MSTP_RSPI0    SYSTEM.MSTPCRB.BIT.MSTPB17
#define    MSTP_DOC    SYSTEM.MSTPCRB.BIT.MSTPB6
#define    MSTP_SCI12    SYSTEM.MSTPCRB.BIT.MSTPB4
#define    MSTP_SMCI12    SYSTEM.MSTPCRB.BIT.MSTPB4
#define    MSTP_CAC    SYSTEM.MSTPCRC.BIT.MSTPC19
#define    MSTP_RAM0    SYSTEM.MSTPCRC.BIT.MSTPC0

#define    __IR( x )        ICU.IR[ IR ## x ].BIT.IR
#define     _IR( x )        __IR( x )
#define      IR( x , y )    _IR( _ ## x ## _ ## y )
#define    __DTCE( x )        ICU.DTCER[ DTCE ## x ].BIT.DTCE
#define     _DTCE( x )        __DTCE( x )
#define      DTCE( x , y )    _DTCE( _ ## x ## _ ## y )
#define    __IEN( x )        ICU.IER[ IER ## x ].BIT.IEN ## x
#define     _IEN( x )        __IEN( x )
#define      IEN( x , y )    _IEN( _ ## x ## _ ## y )
#define    __IPR( x )        ICU.IPR[ IPR ## x ].BIT.IPR
#define     _IPR( x )        __IPR( x )
#define      IPR( x , y )    _IPR( _ ## x ## _ ## y )
#define    __VECT( x )        VECT ## x
#define     _VECT( x )        __VECT( x )
#define      VECT( x , y )    _VECT( _ ## x ## _ ## y )
#define    __MSTP( x )        MSTP ## x
#define     _MSTP( x )        __MSTP( x )
#define      MSTP( x )        _MSTP( _ ## x )

