AndEmi81/indesit_inertia_rx210/HAL/RN_RX100/RN_RX100_reg.h
#define    BSC        (*(volatile struct st_bsc    *)0x81300)
#define    CAC        (*(volatile struct st_cac    *)0x8B000)
#define    CMT        (*(volatile struct st_cmt    *)0x88000)
#define    CMT0    (*(volatile struct st_cmt0   *)0x88002)
#define    CMT1    (*(volatile struct st_cmt0   *)0x88008)
#define    CRC        (*(volatile struct st_crc    *)0x88280)
#define    DOC        (*(volatile struct st_doc    *)0x8B080)
#define    DTC        (*(volatile struct st_dtc    *)0x82400)
#define    FLASH    (*(volatile struct st_flash  *)0x7FC090)
#define    ICU        (*(volatile struct st_icu    *)0x87000)
#define    IWDT    (*(volatile struct st_iwdt   *)0x88030)
#define    MPC        (*(volatile struct st_mpc    *)0x8C11F)
#define    MTU        (*(volatile struct st_mtu    *)0x88680)
#define    MTU0    (*(volatile struct st_mtu0   *)0x88690)
#define    MTU1    (*(volatile struct st_mtu1   *)0x88690)
#define    MTU2    (*(volatile struct st_mtu2   *)0x88692)
#define    MTU5    (*(volatile struct st_mtu5   *)0x88694)
#define    PORT    (*(volatile struct st_port   *)0x8C120)
#define    PORT0    (*(volatile struct st_port0  *)0x8C000)
#define    PORT1    (*(volatile struct st_port1  *)0x8C001)
#define    PORT2    (*(volatile struct st_port2  *)0x8C002)
#define    PORT3    (*(volatile struct st_port3  *)0x8C003)
#define    PORT4    (*(volatile struct st_port4  *)0x8C004)
#define    PORT5    (*(volatile struct st_port5  *)0x8C005)
#define    PORTA    (*(volatile struct st_porta  *)0x8C00A)
#define    PORTB    (*(volatile struct st_portb  *)0x8C00B)
#define    PORTC    (*(volatile struct st_portc  *)0x8C00C)
#define    PORTE    (*(volatile struct st_porte  *)0x8C00E)
#define    PORTH    (*(volatile struct st_porth  *)0x8C011)
#define    PORTJ    (*(volatile struct st_portj  *)0x8C012)
#define    RIIC0    (*(volatile struct st_riic   *)0x88300)
#define    RSPI0    (*(volatile struct st_rspi   *)0x88380)
#define    RTC        (*(volatile struct st_rtc    *)0x8C400)
#define    RTCB    (*(volatile struct st_rtcb   *)0x8C402)
#define    S12AD    (*(volatile struct st_s12ad  *)0x89000)
#define    SCI1    (*(volatile struct st_sci1   *)0x8A020)
#define    SCI5    (*(volatile struct st_sci1   *)0x8A0A0)
#define    SCI12    (*(volatile struct st_sci12  *)0x8B300)
#define    SMCI1    (*(volatile struct st_smci   *)0x8A020)
#define    SMCI5    (*(volatile struct st_smci   *)0x8A0A0)
#define    SMCI12    (*(volatile struct st_smci   *)0x8B300)
#define    SYSTEM    (*(volatile struct st_system *)0x80000)

#define _RST_COPY_VALUE			 (*((uint32_t *) &ResetInfo.ResetSource))
#endif /*__RX_LITTLE_ENDIAN__*/
